// 6.Написать программу вычисления значения функции y = sin(a). (класс Match).

double a=Convert.ToDouble(Console.ReadLine());
double y=Math.Sin(a);
System.Console.WriteLine(y);